In [13]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [14]:
train = pd.read_csv('train1.csv')
train_original = train.copy()

In [15]:
train.head()

,Unnamed: 0,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Purchase,Product_Category_3
0,1,1229,0,0,10,0,2,0,0,6.0,15200,14.0
1,3,416,0,0,10,0,2,0,11,14.0,1057,NaN
2,5,958,1,2,15,0,3,0,0,2.0,15227,NaN
3,6,889,1,4,7,1,2,1,0,8.0,19215,17.0
4,7,1646,1,4,7,1,2,1,0,15.0,15854,NaN

In [16]:
Product_Category_3 = train[train['Product_Category_3'].isnull()]

In [17]:
Product_Category_3.shape

(383247, 12)

In [18]:
Product_Category_3.head()

,Unnamed: 0,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Purchase,Product_Category_3
1,3,416,0,0,10,0,2,0,11,14.0,1057,NaN
2,5,958,1,2,15,0,3,0,0,2.0,15227,NaN
4,7,1646,1,4,7,1,2,1,0,15.0,15854,NaN
5,8,1788,1,4,7,1,2,1,0,16.0,15686,NaN
6,10,1238,1,2,20,0,1,1,4,11.0,5254,NaN

In [19]:
train_P3 =  train.dropna()
train_P3 = train_P3.drop(['Unnamed: 0'], axis=1)

In [20]:
train_P3.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Purchase,Product_Category_3
0,1229,0,0,10,0,2,0,0,6.0,15200,14.0
3,889,1,4,7,1,2,1,0,8.0,19215,17.0
7,675,1,2,20,0,1,1,0,2.0,15665,5.0
8,1152,0,5,9,0,1,0,4,8.0,5378,14.0
10,1784,0,5,9,0,1,0,1,3.0,13055,4.0

In [21]:
test_P3 = Product_Category_3.drop(['Unnamed: 0','Product_Category_3'],axis=1)
test_P3.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Purchase
1,416,0,0,10,0,2,0,11,14.0,1057
2,958,1,2,15,0,3,0,0,2.0,15227
4,1646,1,4,7,1,2,1,0,15.0,15854
5,1788,1,4,7,1,2,1,0,16.0,15686
6,1238,1,2,20,0,1,1,4,11.0,5254

In [22]:
X_train = train_P3.drop(['Product_Category_3'], axis=1)
y_train = train_P3['Product_Category_3']

model = LinearRegression()
model.fit(X_train,y_train)

LinearRegression()

In [23]:
predicted = np.round(model.predict(test_P3))
predicted

array([15., 10., 17., ..., 20., 20., 20.])

In [24]:
test_P3['Product_Category_3'] = predicted
test_P3.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Purchase,Product_Category_3
1,416,0,0,10,0,2,0,11,14.0,1057,15.0
2,958,1,2,15,0,3,0,0,2.0,15227,10.0
4,1646,1,4,7,1,2,1,0,15.0,15854,17.0
5,1788,1,4,7,1,2,1,0,16.0,15686,18.0
6,1238,1,2,20,0,1,1,4,11.0,5254,15.0

In [25]:
trainP3 = train_P3.append(test_P3)

In [26]:
trainP3.shape

(550068, 11)

In [27]:
trainP3.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Purchase,Product_Category_3
0,1229,0,0,10,0,2,0,0,6.0,15200,14.0
3,889,1,4,7,1,2,1,0,8.0,19215,17.0
7,675,1,2,20,0,1,1,0,2.0,15665,5.0
8,1152,0,5,9,0,1,0,4,8.0,5378,14.0
10,1784,0,5,9,0,1,0,1,3.0,13055,4.0

In [28]:
trainP3.to_csv('train_final.csv')

TEST DATA

In [29]:
test = pd.read_csv('test1.csv')
test_original = test.copy()

In [30]:
Product_Category_3 = test[test['Product_Category_3'].isnull()]
train_P3 =  test.dropna()
train_P3 = train_P3.drop(['Unnamed: 0'], axis=1)

In [31]:
test_P3 = Product_Category_3.drop(['Unnamed: 0','Product_Category_3'],axis=1)
test_P3.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2
0,588,1,4,7,1,2,1,0,11.0
1,505,1,2,17,2,0,0,2,5.0
2,1372,0,3,1,1,4,1,4,14.0
3,662,0,3,1,1,4,1,3,9.0
9,331,1,1,15,0,4,0,4,14.0

In [32]:
X_train = train_P3.drop(['Product_Category_3'], axis=1)
y_train = train_P3['Product_Category_3']

model = LinearRegression()
model.fit(X_train,y_train)

LinearRegression()

In [33]:
predicted = np.round(model.predict(test_P3))
predicted

array([15., 12., 16., ..., 16., 15., 15.])

In [34]:
test_P3['Product_Category_3'] = predicted
test_P3.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,588,1,4,7,1,2,1,0,11.0,15.0
1,505,1,2,17,2,0,0,2,5.0,12.0
2,1372,0,3,1,1,4,1,4,14.0,16.0
3,662,0,3,1,1,4,1,3,9.0,13.0
9,331,1,1,15,0,4,0,4,14.0,16.0

In [35]:
test1 = pd.read_csv("test.csv")
test1.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [37]:
trainP3 = train_P3.append(test_P3)
trainP3['User_ID'] = test1['User_ID']
trainP3['Product_ID_1'] = test1['Product_ID']
trainP3.to_csv('test_final.csv')